{
  "labels": {
    "import": "импорт",
    "reconnect": "переподключить",
    "stop": "остановить",
    "show_config": "config.json",
    "manage": "настроить",
    "add": "добавить",
    "server": "сервер",
    "client": "клиент",
    "transport": "транспорт",
    "sniffing": "сниффинг",
    "apply": "применить",
    "close": "закрыть",
    "xrayui_desc": "XRAYUI предоставляет простой интерфейс для управления конфигурацией ядра XRAY и мониторинга его состояния."
  },
  "components": {
    "ClientStatus": {
      "configuration": "Конфигурация",
      "connection_status": "Статус подключения",
      "general_options": "Общие настройки",
      "xray_connecting": "Проверка соединения...",
      "xray_connected": "XRAY подключен",
      "xray_stopped": "XRAY остановлен",
      "xray_running": "XRAY запущен"
    },
    "GeneralOptionsModal": {
      "modal_title": "Общие настройки XRAYUI",
      "check_xray_connection": "Проверить соединение с сервером XRAY",
      "start_xray_on_reboot": "Запуск XRAY при перезагрузке роутера",
      "modalConnectTitle": "Проверка соединения XRAY",
      "modalConnectCheckDescription": "<p>Эта опция проверяет, работает ли фактическое соединение, отправляя запрос на <a href=\"https://ip-api.com/\" target=\"_blank\">ip-api.com</a> через исходящий прокси при запуске.</p><p>XRAYUI вставит системное правило в правила маршрутизации и создаст входящий SOCKS-прокси для этой проверки. Эти системные настройки помечены как <code>sys</code> и останутся скрытыми в интерфейсе.</p>"
    },
    "ImportConfig": {
      "import_config_file": "Импорт файла конфигурации"
    },
    "ImportConfigModal": {
      "modal_title": "Импорт конфигурации",
      "modal_desc": "Здесь вы можете импортировать конфигурацию с помощью QR-кода или URL протокола.",
      "label_qr_code": "QR-код",
      "label_proxy_uri": "URI исходящего прокси",
      "label_complete_setup": "Я хочу полную настройку!",
      "label_unblock": "Разблокировать",
      "label_dont_break": "Не нарушать работу моих сетевых устройств",
      "hint_qr_code": "Попробуйте сделать скриншот вашего QR-кода, и XRAYUI попытается его распознать.",
      "hint_proxy_uri": "Здесь вы можете вставить URL протокола. Обычно они начинаются с `vless://` или `vmess://`.",
      "hint_complete_setup": "Если вы выберете эту опцию, XRAYUI перезапишет вашу текущую конфигурацию наиболее подходящей конфигурацией по умолчанию для импортированного протокола.<hr />Будет создано правило маршрутизации по умолчанию для проверки исходящего подключения прокси. После импорта и применения конфигурации вы можете открыть `https://ip-api.com/`, чтобы увидеть IP сервера, к которому вы подключены.<hr />После этого рекомендуется настроить собственные правила маршрутизации трафика.",
      "hint_unblock": "Выберите сервисы, которые вы хотите разблокировать. Это автоматически создаст правило маршрутизации, направляющее их трафик через прокси.<hr />Рекомендуется выбирать только те сервисы, которые заблокированы в вашем регионе. Позже вы сможете добавить, обновить или удалить эти правила в разделе «Маршрутизация».",
      "hint_dont_break": "Установите этот флажок, если у вас в сети роутера есть IoT-устройства, такие как «Smart TV», «Xbox», «PlayStation» или другие устройства, которые вы предпочли бы не затрагивать XRAY.<hr />Эта опция ограничивает перенаправление трафика к XRAY через ваш роутер, уменьшая риск отключения этих устройств. Позже вы сможете настроить эту опцию в разделе маршрутизации («Политика переадресации/обхода портов»).<hr />Если у вас нет IoT-устройств, лучше оставить эту опцию выключенной."
    },
    "ConfigModal": {
      "modal_title": "Файл конфигурации XRAY",
      "hide_sensetive_data": "скрыть конфиденциальные данные",
      "open_raw": "открыть в исходном виде",
      "copy_to_clipboard": "скопировать в буфер обмена",
      "alert_copy_ok_hiddendata": "Конфигурация скопирована в буфер обмена. Конфиденциальные данные скрыты. Однако, пожалуйста, проверьте конфигурацию перед её распространением.",
      "alert_copy_ok_nohiddendata": "Конфигурация скопирована в буфер обмена. Внимание: конфиденциальные данные видны. Пожалуйста, будьте осторожны при её распространении."
    }
  }
}
